cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'dteoh/sqa'

brew 'ack'
brew 'coreutils'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libgit2'
brew 'mas'
brew 'neovim'
brew 'openssl'
brew 'postgresql'
brew 'ripgrep'
brew 'tree'
brew 'unrar'
brew 'wget'
brew 'spaceman-diff'

# Javascript
brew 'node'
brew 'yarn'

# Python
brew 'python@2'
brew 'python@3'

# Ruby
brew 'ruby-build'
brew 'rbenv'


# Fonts
cask 'font-hack-nerd-font'

# Tmux
brew 'tmux'
brew 'reattach-to-user-namespace'

# Browsers
cask 'firefox'
cask 'google-chrome'

# Chat app
cask 'whatsapp'
cask 'slack'

# Media
cask 'vlc'
cask 'spotify'
cask 'subtitles'
cask 'pennywise'

# Productivity
cask 'freedom'
cask 'notion'
cask 'spectacle'
cask 'nordvpn'
cask 'grammarly'
cask 'itsycal'
cask 'slowquitapps'
cask 'gifcapture'
cask 'skitch'

# Development
cask 'paw'
cask 'charles'
cask 'iterm2'
cask 'postman'
cask 'kaleidoscope'
cask 'go2shell'
cask 'gitup'

mas 'Amphetamine', id: 937984704
